{"1. What does client-side mean?":[{"title":"What does client-side mean?","content":"\nIn web development, 'client side' refers to everything in a web application that is displayed or takes place on the client (end user device). This includes what the user sees, such as text, images, and the rest of the UI, along with any actions that an application performs within the user's browser.\n\nMarkup languages like HTML and CSS are interpreted by the browser on the client side.\n","section":"1. What does client-side mean?","source":"https://www.cloudflare.com"}],"10. what is node.js":[{"title":"What is node.js","content":"\nNode.js is an open-source, cross-platform, back-end JavaScript runtime environment that runs on the V8 engine and executes JavaScript code outside a web browser.\n","section":"10. what is node.js"}],"2. What does server side mean?":[{"title":"What does server side mean?","content":"\n`server side` means everything that happens on the server, instead of on the client. In the past, nearly all business logic ran on the server side, and this included rendering dynamic webpages, interacting with databases, identity authentication, and push notifications.\n","section":"2. What does server side mean?","source":"https://www.cloudflare.com/"}],"3. What does headless mean in software?":[{"title":"What does headless mean in software?","content":"\nHeadless software (e.g. \"headless browser\" or \"headless Linux\",) is software capable of working on a device without a graphical user interface. Such software receives inputs and provides output through other interfaces like network or serial port and is common on servers and embedded devices.\n","section":"3. What does headless mean in software?"}],"4. How do I use headless browser?":[{"title":"How do I use headless browser?","content":"\nHeadless browsers are a web browser without a graphical user interface that can be controlled from a command line interface programmatically for the purpose of web page automation (e.g., functional testing, scraping, unit testing, etc.). Think of headless browsers as a browser that you can run programmatically from the command line that can retrieve and traverse web page code.\n\nThe most common headless browsers are:\n\n- Headless Chromium\n- Puppeteer\n","section":"4. How do I use headless browser?"}],"5. What is WebView used for?":[{"title":"What is WebView used for?","content":"\nWebviews are used by a native OS, in a native application, to run web pages. Think of a webview like an iframe or a single tab from a web browser that is embedded in a native application running on a device (e.g., iOS, android, windows).\n","section":"5. What is WebView used for?"}],"6. What is the difference HTTP and https?":[{"title":"What is the difference HTTP and https?","content":"\nHTTPS is HTTP with encryption and verification. The only difference between the two protocols is that HTTPS uses TLS (SSL) to encrypt normal HTTP requests and responses, and to digitally sign those requests and responses. As a result, HTTPS is far more secure than HTTP.\n","section":"6. What is the difference HTTP and https?"}],"7. What is TLS":[{"title":"What is TLS (Transport Layer Security)?","content":"\nTLS is a cryptographic protocol that provides end-to-end security of data sent between applications over the Internet. It is mostly familiar to users through its use in secure web browsing.\n","section":"7. What is TLS","source":"https://www.cloudflare.com/"}],"8. What is a network protocol?":[{"title":"What is a network protocol?","content":"\nA network protocol is an established set of rules that determine how data is transmitted between different devices in the same network.\n","section":"8. What is a network protocol?","source":"https://www.cloudflare.com/"}],"9. What does a CMS actually do?":[{"title":"What does a CMS actually do?","content":"\nA CMS, short for content management system, is a software application that allows users to build and manage a website without having to code it from scratch, or know how to code at all. With a CMS, you can create, manage, modify, and publish content in a user-friendly interface.\n","section":"9. What does a CMS actually do?"}]}